app/views/api/pokemon/show.json.jbuilder

  json.extract! @pokemon, :id, :name, :attack, :defense, :moves, :poke_type
  json.itemIds @pokemon.items.ids
---
SELECT "items".* FROM "items" WHERE "items"."pokemon_id" = 1